# SlabShapeCreaseArray Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeCreaseArray Class
Members See Also
---
An array that can contain any number of creases used in Slab Shape Editing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class SlabShapeCreaseArray : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class SlabShapeCreaseArray _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class SlabShapeCreaseArray : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..SlabShapeCreaseArray
# See Also
SlabShapeCreaseArray Members
Autodesk.Revit.DB Namespace